## 722713121070: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cbs_conformance_pack will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cbs_conformance_pack"  {
      ~ id       = "d6612244bf7d3915a5166fdf48dfb28c9055a19cecc8d906cf6e8c4b6ccbd0cf" -> (known after apply)
      ~ rendered = <<-EOT
            ##################################################################################
            #                                                                                 
            #   Conformance Pack:                                                             
            #     Canadian Centre for Cyber Security (CCCS) Cloud Based Sensor (CBS)                                
            #                                                                                 
            #   This conformance pack helps verify compliance with CBS requirements.   
            #                                                                                 
            #   See Parameters section for names and descriptions of required parameters.     
            #                                                                                 
            ##################################################################################
            
            Resources:
              CloudtrailEnabled:
                Properties:
                  ConfigRuleName: cbs_cloudtrail_enabled
                  Description: A Config rule that checks that CloudTrail is enabled and logging to a given bucket.
                  InputParameters:
                    s3BucketName: cbs-satellite-722713121070
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::CloudTrail::Trail
                  Source:
                    Owner: AWS
                    SourceIdentifier: CLOUD_TRAIL_ENABLED
                Type: AWS::Config::ConfigRule
              ElbLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_elb_logging_enabled
                  Description: Checks that the CBS satellite bucket exists in the account.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::ElasticLoadBalancing::LoadBalancer
                      - AWS::ElasticLoadBalancingV2::LoadBalancer
                  Source:
                    Owner: AWS
                    SourceIdentifier: ELB_LOGGING_ENABLED
                Type: AWS::Config::ConfigRule
              S3BucketLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_s3_bucket_logging_enabled
                  Description: A Config rule that checks whether logging to the cbs satellite is enabled for your S3 buckets.
                  InputParameters:
                    targetBucket: cbs-satellite-722713121070
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:722713121070:function:CbsS3AccessLogsRule
                Type: AWS::Config::ConfigRule
              S3SatelliteBucket:
                Properties:
                  ConfigRuleName: cbs_s3_satellite_bucket_rule
                  Description: Checks that the CBS satellite bucket exists in the account.
                  InputParameters:
                    satelliteBucket: cbs-satellite-722713121070
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:722713121070:function:CbsS3SatelliteBucketRule
                Type: AWS::Config::ConfigRule
              VpcFlowLogsEnabled:
                Properties:
                  ConfigRuleName: cbs_vpc_flow_logging_enabled
                  Description: A Config rule that checks whether VPC flow logs are enabled.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::EC2::VPC
                  Source:
                    Owner: AWS
                    SourceIdentifier: VPC_FLOW_LOGS_ENABLED
                Type: AWS::Config::ConfigRule
              WAFv2LoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_wafv2_logs_rule
                  Description: Checks that the WAFV2 ACL's are logging to either S3 or Kinesis.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::WAFv2::WebACL
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:722713121070:function:cbs-wafv2-logs-rule
                Type: AWS::Config::ConfigRule
        EOT -> (known after apply)
      ~ vars     = {
          ~ "cbs_wafv2_logs_rule_lambda_arn"          = "arn:aws:lambda:ca-central-1:722713121070:function:cbs-wafv2-logs-rule" -> (known after apply)
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_log_group.cbs_wafv2_logs_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_wafv2_logs_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cbs-wafv2-logs-rule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-722713121070"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-722713121070"
          + "Terraform"  = "true"
        }
    }

  # aws_config_conformance_pack.cbs will be updated in-place
  ~ resource "aws_config_conformance_pack" "cbs" {
        id            = "cloud-based-sensor"
        name          = "cloud-based-sensor"
      ~ template_body = <<-EOT
            ##################################################################################
            #                                                                                 
            #   Conformance Pack:                                                             
            #     Canadian Centre for Cyber Security (CCCS) Cloud Based Sensor (CBS)                                
            #                                                                                 
            #   This conformance pack helps verify compliance with CBS requirements.   
            #                                                                                 
            #   See Parameters section for names and descriptions of required parameters.     
            #                                                                                 
            ##################################################################################
            
            Resources:
              CloudtrailEnabled:
                Properties:
                  ConfigRuleName: cbs_cloudtrail_enabled
                  Description: A Config rule that checks that CloudTrail is enabled and logging to a given bucket.
                  InputParameters:
                    s3BucketName: cbs-satellite-722713121070
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::CloudTrail::Trail
                  Source:
                    Owner: AWS
                    SourceIdentifier: CLOUD_TRAIL_ENABLED
                Type: AWS::Config::ConfigRule
              ElbLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_elb_logging_enabled
                  Description: Checks that the CBS satellite bucket exists in the account.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::ElasticLoadBalancing::LoadBalancer
                      - AWS::ElasticLoadBalancingV2::LoadBalancer
                  Source:
                    Owner: AWS
                    SourceIdentifier: ELB_LOGGING_ENABLED
                Type: AWS::Config::ConfigRule
              S3BucketLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_s3_bucket_logging_enabled
                  Description: A Config rule that checks whether logging to the cbs satellite is enabled for your S3 buckets.
                  InputParameters:
                    targetBucket: cbs-satellite-722713121070
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:722713121070:function:CbsS3AccessLogsRule
                Type: AWS::Config::ConfigRule
              S3SatelliteBucket:
                Properties:
                  ConfigRuleName: cbs_s3_satellite_bucket_rule
                  Description: Checks that the CBS satellite bucket exists in the account.
                  InputParameters:
                    satelliteBucket: cbs-satellite-722713121070
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:722713121070:function:CbsS3SatelliteBucketRule
                Type: AWS::Config::ConfigRule
              VpcFlowLogsEnabled:
                Properties:
                  ConfigRuleName: cbs_vpc_flow_logging_enabled
                  Description: A Config rule that checks whether VPC flow logs are enabled.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::EC2::VPC
                  Source:
                    Owner: AWS
                    SourceIdentifier: VPC_FLOW_LOGS_ENABLED
                Type: AWS::Config::ConfigRule
              WAFv2LoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_wafv2_logs_rule
                  Description: Checks that the WAFV2 ACL's are logging to either S3 or Kinesis.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::WAFv2::WebACL
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:722713121070:function:cbs-wafv2-logs-rule
                Type: AWS::Config::ConfigRule
        EOT -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.policy will be updated in-place
  ~ resource "aws_iam_policy" "policy" {
        id          = "arn:aws:iam::722713121070:policy/CbsS3AccessLogsPolicy"
        name        = "CbsS3AccessLogsPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "config:PutEvaluations",
                            "s3:ListAllMyBuckets",
                            "s3:GetBucketLogging",
                          + "s3:GetBucketAcl",
                          + "config:PutEvaluations",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "cbs-722713121070"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.write_waf_logs will be destroyed
  # (because aws_iam_policy.write_waf_logs is not in configuration)
  - resource "aws_iam_policy" "write_waf_logs" {
      - arn         = "arn:aws:iam::722713121070:policy/cbs-722713121070-write-waf-logs" -> null
      - description = "Allow writing WAF logs to S3 + CloudWatch" -> null
      - id          = "arn:aws:iam::722713121070:policy/cbs-722713121070-write-waf-logs" -> null
      - name        = "cbs-722713121070-write-waf-logs" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::cbs-satellite-722713121070"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject*",
                          - "s3:GetObject*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::cbs-satellite-722713121070/waf_acl_logs/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA2QRIPCEXMMEM2K7VU" -> null
      - tags        = {
          - "CostCentre" = "cbs-722713121070"
          - "Terraform"  = "true"
        } -> null
      - tags_all    = {
          - "CostCentre" = "cbs-722713121070"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_iam_role.cbs_wafv2_logs_rule will be created
  + resource "aws_iam_role" "cbs_wafv2_logs_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cbs-wafv2-logs-rule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-722713121070"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-722713121070"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cbs_wafv2_logs_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_wafv2_logs_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "cbs-wafv2-logs-rule"
    }

  # aws_iam_role_policy_attachment.cbs_wafv2_logs_rule_wafv2_list_web_acls will be created
  + resource "aws_iam_role_policy_attachment" "cbs_wafv2_logs_rule_wafv2_list_web_acls" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::722713121070:policy/cbs-wafv2-acls-policy"
      + role       = "cbs-wafv2-logs-rule"
    }

  # aws_lambda_function.cbs_wafv2_logs_rule will be created
  + resource "aws_lambda_function" "cbs_wafv2_logs_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_wafv2_logs_rule.zip"
      + function_name                  = "cbs-wafv2-logs-rule"
      + handler                        = "webacl_logs_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "jCX9PDXvZOdK1lA3jzrkKwYGm7iYzRHZHz0MCw5UeKo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-722713121070"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-722713121070"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.cbs_wafv2_logs_rule will be created
  + resource "aws_lambda_permission" "cbs_wafv2_logs_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

Plan: 6 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

10 tests, 8 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
